Revit 2027 API
FabricationPartSizeMap.PaletteId Property
 The palette identifier of the straight.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int PaletteId { get; set; }
Public Property PaletteId As Integer
	Get
	Set
public:
property int PaletteId {
	int get ();
	void set (int value);
}
member PaletteId : int with get, set
Property Value
Int32
See Also
Reference
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace